Repository: manfred-mueller/Wrok
Catalog: Properties/Resources.*.resx
Languages: de

source: Exit
de: Beenden

source: Personality
de: Personalisieren

source: Show window
de: Fenster anzeigen

source: Speech mode activated
de: Sprachmodus aktiviert

source: Speech mode button not found
de: Schaltfläche „Sprachmodus“ nicht gefunden

source: None
de: Keine

source: Inaktivity
de: Inaktivität

source: {0} seconds
de: {0} Sekunden

source: Settings
de: Einstellungen

# Reload
source: Reload window
de: Fenster aktualisieren

source: {0} (deactivated)
de: {0} (deaktiviert)

source: Wrok - click to open
de: Wrok – zum Öffnen klicken

source: Clear cache
de: Cache löschen

source: Clear browsing data
de: Browserdaten löschen

source: Choose what to be deleted:
de: Wählen Sie aus, was gelöscht werden soll:

source: Clear Cache only
de: Nur Cache löschen

source: Delete all
de: Alles löschen

source: Cache cleared
de: Cache geleert

# PicturesScriptsAndOtherDataDeletedNYouAreStillLoggedIn
source: Pictures, scripts and other data deleted. You are still logged in.
de: Bilder, Skripte und andere Daten gelöscht. Sie sind noch angemeldet.

# CookiesLoginDataAndSettingsDeletedNYouAreLoggedOut
source: Cookies, Login-Data and Settings deleted. You are logged out.
de: Cookies, Login-Daten und Einstellungen gelöscht. Sie sind abgemeldet.

source: Error
de: Fehler

source: All data deleted
de: Alle Daten gelöscht

# ErrorWhileDeletingCacheN0
source: Error while deleting cache: {0}
de: Fehler beim Löschen des Caches: {0}

source: WebView2 not initialized yet.
de: WebView2 ist noch nicht initialisiert.

source: Delete cache
de: Cache löschen

source: ClearCacheAsync failed
de: ClearCacheAsync ist fehlgeschlagen

source: Delete favorites
de: Favoriten löschen

source: Couldn't open link to GitHub: {0}
de: Link zu GitHub konnte nicht geöffnet werden: {0}

source: Link couldn't be oepened.
de: Link konnte nicht geöffnet werden.

# AboutWrok
source: About Wrok / Manual
de: Über Wrok / Handbuch

source: Close
de: Schließen

source: Unknown version
de: Unbekannte Version

source: Send
de: Senden

source: Send + Enter
de: Senden + Eingabetaste

source: Edit
de: Bearbeiten

source: Delete
de: Löschen

source: Delete macro?
de: Makro löschen?

source: Confirm
de: Bestätigen

source: Edit macro
de: Makro bearbeiten

source: New macro
de: Neues Makro

source: Cancel
de: Abbrechen

source: Macros
de: Makros

# NewMacroMenuItem
source: New Macro...
de: Neues Makro...

source: WebView2 is not initialized yet.
de: WebView2 ist noch nicht initialisiert.

source: Cache has been deleted.
de: Cache wurde gelöscht.

source: Error while deleting cache:
de: Fehler beim Löschen des Caches:

# ClearCacheFailed
source: ClearCacheAsync failed:
de: ClearCacheAsync ist fehlgeschlagen:

source: Macro {0}
de: Makro {0}

source: Ctrl+{0}
de: Strg+{0}

source: Ctrl
de: Strg

source: +Shift
de: +Umschalt

source: Ctrl+^
de: Strg+^

source: Edit with right click. Run with {0}
de: Mit Rechtsklick bearbeiten. Mit {0} ausführen

source: Macro click send failed: {0}
de: Senden des Makroklicks fehlgeschlagen: {0}

source: EditMacroAndSave failed: {0}
de: EditMacroAndSave fehlgeschlagen: {0}

source: Left-click sends and submits. Shift+Click sends without Enter.
de: Klicken Sie mit der linken Maustaste zum Senden. Umschalt+Klick trägt ein ohne zu senden.

source: SaveMacros failed: {0}
de: SaveMacros fehlgeschlagen: {0}

source: SendTextToWebViewAsync: click succeeded, returning.
de: SendTextToWebViewAsync: Klicken war erfolgreich, Rückkehr.

source: SendTextToWebViewAsync: jsSucceeded true, returning (no click).
de: SendTextToWebViewAsync: jsSucceeded true, Rückgabe (kein Klick).

source: Parsing clickScript result failed: {0}
de: Das ClickScript-Ergebnis konnte nicht analysiert werden: {0}

source: Manual
de: Handbuch

# MacroHelp
source: Macros - Edit: Right-click on a macro in the tray menu -> Edit. - Send via menu: Left-click on a macro to insert the text and send it (Send+Enter). - Send without Enter: Left-click + Shift (or Alt) sends the text WITHOUT pressing Enter. - Hotkeys: Ctrl+1 .. Ctrl+5 send the respective macro. By default, Enter is sent after pasting (as with left-clicking). Hold Shift or Alt while pressing the hotkey to suppress Enter. Boss-Key - To minimize the window press Strg+Tab. Clear cache - Tray menu → ‘Clear cache’ deletes WebView2 browser data (cache, cookies, locally stored data). - When to use: for display errors, login problems, or when a ‘clean’ session is needed. - Note: After clearing, you may need to log in again or reload the page. Troubleshooting / Tips - If text is not being sent: Make sure the page is fully loaded and the editor is visible. - Open DevTools: In debugging situations, WebView2 DevTools can be opened to check DOM/Console. - Messages and logs can be found at %LOCALAPPDATA%\\Wrok\\logs\\app.log Brief overview of operation - Click and hotkey behavior is the same: insert text, then attempt to send via button click or OS Enter. Some web editors ignore synthetic JS keyboard events; therefore a real Enter is sent via InputSimulator if necessary.
de: Makros - Bearbeiten: Rechtsklick auf ein Makro im Tray‑Menü -> Bearbeiten. - Senden per Menü: Linksklick auf ein Makro fügt den Text ein und sendet ihn (Send+Enter). - Senden ohne Enter: Linksklick + Shift (oder Alt) sendet den Text OHNE abschließendes Enter. - Hotkeys: Strg+1 .. Strg+5 senden das jeweilige Makro. Standardmäßig wird nach dem Einfügen Enter gesendet (wie Linksklick). Halte Shift oder Alt beim Hotkey, um Enter zu unterdrücken. Chef-Taste - Zum Minimieren des Fensters die Tastenkombination Strg+Tab drücken. Cache löschen - Tray‑Menü → 'Cache löschen' löscht WebView2‑Browserdaten (Cache, Cookies, lokal gespeicherte Daten). - Wann einsetzen: bei Anzeigefehlern, Login‑Problemen oder wenn eine 'saubere' Sitzung benötigt wird. - Hinweis: Nach dem Löschen kann ein erneuter Login oder erneutes Laden der Seite nötig sein. Fehlerbehebung / Tipps - Wenn Text nicht abgeschickt wird: Stelle sicher, dass die Seite vollständig geladen ist und der Editor sichtbar ist. - DevTools öffnen: In Debugging‑Situationen kann WebView2 DevTools geöffnet werden, um DOM/Console zu prüfen. - Meldungen und Logs findest du unter %LOCALAPPDATA%\\Wrok\\logs\\app.log Kurz zur Bedienung - Verhalten beim Klick und Hotkey ist gleich: Text einfügen, anschließend wird versucht, per Button‑Click oder OS‑Enter zu senden. Einige Web‑Editoren ignorieren synthetische JS‑KeyboardEvents; deshalb wird bei Bedarf ein echtes Enter per InputSimulator gesendet.
